tutorials/incompressible/pimpleRemeshFoam/systemid5deg/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       pimpleFoam;

startFrom         latestTime;

startTime         0;

stopAt            endTime;

endTime           10;

deltaT            0.001;

maxDeltaT         0.01;

adjustTimeStep    yes;

maxCo             1.0;

writeControl      adjustableRunTime;

writeInterval     0.2;

purgeWrite        0;

writeFormat       ascii;

writePrecision    6;

writeCompression  off;

timeFormat        general;

timePrecision     6;

runTimeModifiable true;

functions
{
    #include "include/forceCoefficients"
    #include "include/yPlus"
    #include "include/residuals"
}

// ************************************************************************* //
