tutorials/incompressible/pimpleRemeshFoam/systemid5deg/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
11941
(
(0.999998 2.20185e-05 -9.1595e-25)
(1 2.20121e-05 -2.31795e-24)
(1 2.76232e-05 -1.67414e-25)
(1.00001 3.48956e-05 2.31057e-24)
(0.999997 1.02142e-05 4.12455e-24)
(1.00002 5.01535e-05 2.02633e-25)
(0.999994 1.94069e-05 -8.01063e-25)
(1 3.57789e-05 5.02696e-25)
...
)
;

boundaryField
{
    airfoil
    {
        type            noSlip;
    }
    freestream
    {
        type            freestreamVelocity;
        freestreamValue uniform (1 0 0);
        value           uniform (1 0 0);
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
