tutorials/incompressible/pimpleRemeshFoam/systemid5deg/Allrun
# !/bin/sh
cd "${0%/*}" || exit  # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions  # Tutorial run functions
# ------------------------------------------------------------------------------

foamJob pimpleFoam
foamLog log

# ------------------------------------------------------------------------------
